#include "includes.h"

pFunction Jump_To_Application;



//==================================================================================================
//| 函数名称 | BootToUserApp
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 由BOOTLOAD程序切换到应用程序
//|----------|--------------------------------------------------------------------------------------
//| 调用模块 | 	无
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 |	Address FLASH地址
//|----------|--------------------------------------------------------------------------------------       
//| 返回参数 | 	FLASH 扇区号
//|----------|--------------------------------------------------------------------------------------       
//| 全局变量 |  无
//|----------|-------------------------------------------------------------------------------------- 
//| 函数设计 | 编写人：郑海    时间：2013-05-22 
//|----------|-------------------------------------------------------------------------------------- 
//|   备注   | 切换前先判断应用程序起始地址是否符合要求
//|----------|-------------------------------------------------------------------------------------- 
//| 修改记录 | 修改人：          时间：         修改内容： 
//==================================================================================================
void BootToUserApp(void)
{
	if ((((*(__IO uint32_t*)APP_START_ADDRESS) & 0x2FFE0000 ) == 0x20000000) && (*(__IO uint16_t*)BOOT_FLAG_START_ADDRESS == 0xFFFF))
	{
		__disable_irq();
		Jump_To_Application = (pFunction) (*(__IO uint32_t*) (APP_START_ADDRESS + 4));
		/* Initialize user application's Stack Pointer */
		__set_MSP(*(__IO uint32_t*) APP_START_ADDRESS);
		Jump_To_Application();	
	}	
}

//==================================================================================================
//| 函数名称 | UserAppUpdate
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 擦除应用程序
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | start_address  应用程序区起始地址
//|          |  length  应用程序区大小
//|----------|--------------------------------------------------------------------------------------       
//| 返回参数 | 0 擦除成功
//|          | 1 擦除失败
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 | 编写人：郑海    时间：2013-05-22 
//|----------|-------------------------------------------------------------------------------------- 
//|   备注   | 切换前先判断应用程序起始地址是否符合要求
//|----------|-------------------------------------------------------------------------------------- 
//| 修改记录 | 修改人：          时间：         修改内容： 
//==================================================================================================
u8 EraseUserAppUpdate(u32 start_address, u32 length)
{
	uint32_t NumberOfPage = 0;
	uint32_t EraseCounter = 0;
	volatile FLASH_Status FLASHStatus = FLASH_COMPLETE;

	/**对输入的地址进行必需的检查，避免误擦除BOOTLOAD自身**/
	if((start_address < APP_START_ADDRESS) || (length > APP_ADDRESS_SIZE))
	{
		return 0;//输入参数错误
	}
	
	/**************擦除原应用程序**************************/	
	FLASH_Unlock();

	/* Define the number of page to be erased */
	NumberOfPage = length / FLASH_PAGE_SIZE;

	/* Clear All pending flags */
	FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);	

	/* Erase the FLASH pages */
	for(EraseCounter = 0; EraseCounter < NumberOfPage; EraseCounter++)
	{
		FLASHStatus = FLASH_ErasePage(start_address + (FLASH_PAGE_SIZE * EraseCounter));
		if(FLASHStatus != FLASH_COMPLETE)
		{
			return 0; //更新失败
		}
	}
	return 1;
}

//==================================================================================================
//| 函数名称 | UserAppUpdate
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 更新应用程序
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | start_address  应用程序区起始地址
//|          | ptr  要写入的数据
//|          | length  数据长度
//|----------|--------------------------------------------------------------------------------------       
//| 返回参数 | SUCCESS 更新成功
//|          | ERROR 更新失败
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 | 编写人：郑海    时间：2013-05-22 
//|----------|-------------------------------------------------------------------------------------- 
//|   备注   | 切换前先判断应用程序起始地址是否符合要求
//|----------|-------------------------------------------------------------------------------------- 
//| 修改记录 | 修改人：          时间：         修改内容： 
//==================================================================================================
ErrorStatus UserAppUpdate(u32 start_address, u8* ptr, u32 length)
{
	u32 i,pro_addr, count;
	u32 pro_data;	
	
	FLASH_Unlock();
	pro_addr = start_address;
	count = length/4;
	for(i=0; i< count;i++)
	{
		pro_addr = start_address + i*4;//每次写4个字节
		pro_data = (*(ptr+i*4)) + ((u32)(*(ptr+i*4+1))<<8) + ((u32)(*(ptr+i*4+2))<<16) + ((u32)(*(ptr+i*4+3))<<24);
		if((pro_addr >= APP_START_ADDRESS) && (pro_addr+4 <= (APP_END_ADDRESS+1) ))
		{
			FLASH_ProgramWord(pro_addr, pro_data);
			if(*(u32*)pro_addr != pro_data)
			{
				return ERROR;//写FLASH异常
			}					
		}
		else
		{
			return ERROR; //地址错误
		}
	}
	if((length%4) != 0)
	{
		pro_addr = start_address + i*4;//每次写4个字节
		if((length%4) == 1)
		{
			pro_data = (*(ptr+i*4)) + ((u32)0xFF<<8) + ((u32)0xFF<<16) + ((u32)0xFF<<24);
		}
		else if((length%4) == 2)
		{
			pro_data = (*(ptr+i*4)) + ((u32)(*(ptr+i*4+1))<<8) + ((u32)0xFF<<16) + ((u32)0xFF<<24);
		}
		else
		{
			pro_data = (*(ptr+i*4)) + ((u32)(*(ptr+i*4+1))<<8) + ((u32)(*(ptr+i*4+2))<<16) + ((u32)0xFF<<24);
		}
		if((pro_addr >= APP_START_ADDRESS) && (pro_addr+4 <= (APP_END_ADDRESS+1) ))
		{
			FLASH_ProgramWord(pro_addr, pro_data);
			if(*(u8*)pro_addr != pro_data)
			{
				return ERROR;//写FLASH异常
			}					
		}
		else
		{
			return ERROR; //地址错误
		}		
	}
	return SUCCESS;
}

